#packs here need to be identified by ther ID.  TO find what this is for packages you want to add use this command in powershell 'winget search <appname>
#===========================
#Standard Desktop Apps
#===========================
AgileBits.1Password
SlackTechnologies.Slack
#Microsoft.Teams
#Microsoft.OneDrive
#Microsoft.Office
Microsoft.PowerBI
Google.Chrome
Google.ChromeRemoteDesktop
Brave.Brave
Mozilla.Firefox
Microsoft.DotNet.Runtime.8
Microsoft.DotNet.DesktopRuntime.8
Oracle.JavaRuntimeEnvironment
VideoLAN.VLC
Amazon.Kindle
Amazon.SendToKindle
Adobe.Acrobat.Reader.64-bit
Grammarly.Grammarly.Office
Grammarly.Grammarly
JGraph.Draw
#===========================
#Development
#===========================
KDE.KDiff3
Notepad++.Notepad++
Microsoft.XMLNotepad
microsoft.VisualStudioCode
Microsoft.DotNet.SDK.8
Oracle.JDK.21
python.python.3.9
git.git
github.githubdesktop
GitExtensionsTeam.GitExtensions
Hashicorp.Terraform
hashicorp.vault
#Hashicorp.Packer
#Hashicorp.Vagrant
#Hashicorp.Boundary
#Hashicorp.Consul
TerraformLinters.tflint
JanDeDobbeleer.OhMyPosh
Microsoft.PowerAutomateDesktop
OpenJS.NodeJS
Postman.Postman.Canary
Obsidian.Obsidian
github.cli
Microsoft.PowerAppsCLI
Amazon.AWSCLI
Microsoft.AzureCLI
Google.CloudSDK
#===========================
#content creator
#===========================
obsproject.obsstudio
#===========================
# Utilities
#===========================
JanDeDobbeleer.Aliae
PuTTY.PuTTY
WinSCP.WinSCP
7zip.7zip
RARLab.WinRAR
WinDirStat.WinDirStat
FireDaemon.OpenSSL
GnuPG.Gpg4win
microsoft.windowsTerminal
microsoft.powertoys
microsoft.powershell
docker.dockerdesktop
sysinternals
technsmith.snagit.2024
#===========================
# WSL Images
#===========================
kalilinux.kalilinux
Ubuntu
#===========================
# Security & Network
#===========================
OpenWhisperSystems.Signal
#OpenVPNTechnologies.OpenVPN
#NordSecurity.NordVPN
Yubico.YubikeyManager
#TorProject.TorBrowser
#Insecure.Nmap
#WiresharkFoundation.Wireshark
#Famatech.AdvancedIPScanner
#PortSwigger.BurpSuite.Community
#PortSwigger.BurpSuite.Professional
#Tenable.Nessus